app/Controllers/Frontend.php

SELECT *
FROM `kategori`
---
    public function berita()
    {
        try {
            $beritaModel = new \App\Models\BeritaModel();
            $kategoriModel = new \App\Models\KategoriModel();
            $profilModel = new \App\Models\ProfilModel();

            $search = $this->request->getGet('search');
            $kategori = $this->request->getGet('kategori');
            $page = $this->request->getGet('page') ?: 1;

            $berita = $beritaModel->getAllWithSearch($search, $kategori, $page) ?: [];
            $kategoris = $kategoriModel->findAll() ?: [];