app/Controllers/Halaman.php

    public function index()
    {
        // Cek login dan role admin
        if (!session()->get('logged_in') || session()->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $data = [
            'title' => 'Kelola Halaman',
            'halaman' => $this->halamanModel->findAll()
---
SELECT *
FROM `halaman`