app/Models/BeritaModel.php

SELECT `berita`.*, `kategori`.`nama_kategori`
FROM `berita`
JOIN `kategori` ON `kategori`.`id_kategori` = `berita`.`id_kategori`
ORDER BY `berita`.`created_at` DESC
---
    public function getBeritaWithKategori()
    {
        return $this->select('berita.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = berita.id_kategori')
                    ->orderBy('berita.created_at', 'DESC')
                    ->findAll();

SELECT `berita`.*, `kategori`.`nama_kategori`
FROM `berita`
JOIN `kategori` ON `kategori`.`id_kategori` = `berita`.`id_kategori`
ORDER BY `berita`.`created_at` DESC
 LIMIT 5
---
    public function getLatest($limit = 10)
    {
        return $this->select('berita.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id_kategori = berita.id_kategori')
                    ->orderBy('berita.created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `berita`
JOIN `kategori` ON `kategori`.`id_kategori` = `berita`.`id_kategori`
SELECT `berita`.*, `kategori`.`nama_kategori`
FROM `berita`
JOIN `kategori` ON `kategori`.`id_kategori` = `berita`.`id_kategori`
ORDER BY `berita`.`created_at` DESC
 LIMIT 12
---
    public function getAllWithSearch($search = '', $kategori = '', $page = 1, $perPage = 12)
    {
        $builder = $this->select('berita.*, kategori.nama_kategori')
                        ->join('kategori', 'kategori.id_kategori = berita.id_kategori');

        if ($search) {
            $builder->groupStart()
                    ->like('berita.judul', $search)
                    ->orLike('berita.isi', $search)
                    ->groupEnd();
        }

        if ($kategori) {
            $builder->where('berita.id_kategori', $kategori);
        }

        return $builder->orderBy('berita.created_at', 'DESC')
                       ->paginate($perPage, 'default', $page);