app/Models/DownloadModel.php

    public function getPopularDownloads($limit = 10)
    {
        return $this->select('download.*, kategori_download.nama_kategori_download')
                    ->join('kategori_download', 'kategori_download.id_kategori_download = download.id_kategori_download')
                    ->orderBy('download.hits', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `download`.*, `kategori_download`.`nama_kategori_download`
FROM `download`
JOIN `kategori_download` ON `kategori_download`.`id_kategori_download` = `download`.`id_kategori_download`
ORDER BY `download`.`hits` DESC
 LIMIT 5