app/Models/GaleriModel.php

SELECT *
FROM `galeri`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function getLatest($limit = 10)
    {
        return $this->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

SELECT *
FROM `galeri`
ORDER BY `created_at` DESC
---
    public function getAllWithSearch($search = '', $sort = 'latest')
    {
        $builder = $this->select('*');

        if ($search) {
            $builder->groupStart()
                    ->like('judul', $search)
                    ->orLike('deskripsi', $search)
                    ->groupEnd();
        }

        switch ($sort) {
            case 'oldest':
                $builder->orderBy('created_at', 'ASC');
                break;
            case 'az':
                $builder->orderBy('judul', 'ASC');
                break;
            case 'za':
                $builder->orderBy('judul', 'DESC');
                break;
            default:
                $builder->orderBy('created_at', 'DESC');
                break;
        }

        return $builder->findAll();