app/Models/PesanKontakModel.php

SELECT COUNT(*) AS `numrows`
FROM `pesan_kontak`
SELECT COUNT(*) AS `numrows`
FROM `pesan_kontak`
WHERE `status` = 'baru'
SELECT COUNT(*) AS `numrows`
FROM `pesan_kontak`
WHERE `status` = 'dibaca'
SELECT COUNT(*) AS `numrows`
FROM `pesan_kontak`
WHERE `status` = 'dibalas'
---
    public function getStatistics()
    {
        $total = $this->countAllResults();
        $baru = $this->where('status', 'baru')->countAllResults();
        $dibaca = $this->where('status', 'dibaca')->countAllResults();
        $dibalas = $this->where('status', 'dibalas')->countAllResults();

SELECT COUNT(*) as jumlah, DATE_FORMAT(tanggal_kirim, '%Y-%m') as bulan
FROM `pesan_kontak`
WHERE YEAR(tanggal_kirim) = '2025'
GROUP BY `bulan`
ORDER BY `bulan` ASC
---
    public function getPesanPerBulan($tahun = null)
    {
        if (!$tahun) {
            $tahun = date('Y');
        }

        return $this->select("COUNT(*) as jumlah, DATE_FORMAT(tanggal_kirim, '%Y-%m') as bulan")
            ->where('YEAR(tanggal_kirim)', $tahun)
            ->groupBy('bulan')
            ->orderBy('bulan', 'ASC')
            ->findAll();