app/Models/ProfilModel.php

    public function getProfil()
    {
        return $this->first();
---
SELECT *
FROM `profil`
 LIMIT 1