app/Models/SlideModel.php

SELECT *
FROM `slide`
WHERE `status` = 'aktif'
ORDER BY `urutan` ASC
---
    public function getActiveSlides()
    {
        return $this->where('status', 'aktif')
                    ->orderBy('urutan', 'ASC')
                    ->findAll();