app/Models/StatsModel.php

SELECT *
FROM `stats`
WHERE `status` = 'aktif'
ORDER BY `urutan` ASC
 LIMIT 4
---
    public function getActiveStats($limit = null)
    {
        $builder = $this->builder();
        $builder->where('status', 'aktif')->orderBy('urutan', 'ASC');
        if ($limit) {
            $builder->limit($limit);
        }
        return $builder->get()->getResultArray();